---
type: ElementTypeDuplicatingEventArgs
namespace: Autodesk.Revit.DB.Events
version: 2024
members: 1
tags: [revit-api, class]
---

# ElementTypeDuplicatingEventArgs

`Autodesk.Revit.DB.Events.ElementTypeDuplicatingEventArgs` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | ElementTypeId | 2015 | `public ElementId ElementTypeId { get ; }` |